test-resources/TerminateSequence.xml

<?xml version="1.0" encoding="UTF-8"?>
   <soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:wsrm="http://schemas.xmlsoap.org/ws/2005/02/rm" xmlns:wsa="http://www.w3.org/2005/08/addressing"> 
      <soapenv:Header>  
         <wsa:MessageID soapenv:mustUnderstand="1">uuid:64f5c3c0-1625-11da-a28e-b3b9c4e71445</wsa:MessageID>  
         <wsa:To soapenv:mustUnderstand="1">http://127.0.0.1:9070/axis/services/RMService</wsa:To>  
         <wsa:Action soapenv:mustUnderstand="1">http://schemas.xmlsoap.org/ws/2005/02/rm/TerminateSequence</wsa:Action>  
         <wsa:From soapenv:mustUnderstand="1">   
            <wsa:Address>http://localhost:8070/axis/services/TestService</wsa:Address>  
         </wsa:From> 
      </soapenv:Header> 
      <soapenv:Body>  
         <wsrm:TerminateSequence>   
            <wsrm:Identifier>uuid:59b0c910-1625-11da-bdfc-b09ed76a1f06</wsrm:Identifier>  
         </wsrm:TerminateSequence> 
      </soapenv:Body>
   </soapenv:Envelope>
